[
    {
        "id": "BoN-ijN-t",
        "text": "POLITY",
        "children": [
            {
                "id": "sIAU9UeZB",
                "title": "[[Constituent Assembly]]",
                "text": "[[Constituent Assembly]]",
                "type": "page",
                "data": [
                    {
                        "id": "k_fwETu-K",
                        "text": "**British Colonial Rule**: India was under British colonial rule, and the struggle for independence had gained momentum by the early 20th century.",
                        "page_id": "sIAU9UeZB",
                        "children": []
                    },
                    {
                        "id": "c4axyJurh",
                        "text": "**Demand for Self-Governance**: The demand for self-governance and a constitution reflecting the aspirations of the Indian people became more pronounced.",
                        "page_id": "sIAU9UeZB",
                        "children": []
                    },
                    {
                        "id": "Y9kFOU8-L",
                        "heading": 3,
                        "text": "History of Formation ",
                        "page_id": "sIAU9UeZB",
                        "video_id": "7BhltHb6sFQ",
                        "time": 120,
                        "children": [
                            {
                                "id": "Gyc1PQZ-k",
                                "text": "In 1922, Mahatma Gandhi, in an article titled ‘Independence’ published in Young India, wrote that Swaraj would not be a free gift of the British Parliament but a declaration of India’s full self-expression—the Constitution of India would be framed as per the wishes of the Indians.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "Gd8nN87pr",
                                "text": "The Commonwealth of India Bill, which was drafted in India and to which Annie Besant, Tej Bahadur Sapru, V.S. Srinivasa Shastri made important contributions, was accepted unanimously by the executive committee of the Parliamentary Labour Party. The Bill had its first reading in the House of Commons in December 1925; it was defeated",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "14ETfmtKK",
                                "text": "Motilal Nehru in February 1924 introduced in the Central Legislative Assembly a resolution that gave due regard to minority rights and interests and came to be known as the **National Demand**.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "zp1EhhPko",
                                "text": "Britain, in response to the National Demand, appointed the all-white **Simon Commission** in November 1927 to recommend further constitutional changes.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "CyRp0eWIm",
                                "text": "In response to Lord Birkenhead’s challenge, the indians appointed the Nehru committee which submitted its report in August 1928, which was later rejected by the British government.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "3_6gW_eVx",
                                "text": "M.N. Roy in 1934 for the first time suggested for making a constitution assembly to draft a constitution for India. The Indian national congress held its session at Lucknow in April 1936 presided by Jawaharlal Nehru. The official demand for a Constituent Assembly was raised and the Government of India Act, 1935 was rejected as it was an imposition on the people of India.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "dW24GYQr9",
                                "text": "**Cabinet Mission Plan (1946)**: The British government sent the Cabinet Mission to India in 1946 to discuss the transfer of power. The mission proposed a plan to form a Constituent Assembly to draft a new constitution. Thus the constituent assembly was formed in 1946 as per the recommendation of the cabinet mission plan.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "yfrSccXHd",
                                "text": "**Elections for Constituent Assembly** The Assembly consisted of representatives (389) from various provinces (296) and princely states (92). The elected members of the Constituent Assembly were chosen indirectly by the Provincial Legislative Assemblies following the Cabinet Mission Plan. Members from the princely states were nominated by the princes. Thus, the Constituent Assembly consisted of both elected and appointed members.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "c1TlX7BuV",
                        "heading": 3,
                        "text": "Important Committees ",
                        "page_id": "sIAU9UeZB",
                        "video_id": "7BhltHb6sFQ",
                        "time": 223,
                        "children": [
                            {
                                "id": "qfcy8PxFv",
                                "heading": 3,
                                "text": "Major Committees",
                                "page_id": "sIAU9UeZB",
                                "children": [
                                    {
                                        "id": "bNKBBVrs-",
                                        "text": "1. Union Powers Committee – Jawaharlal Nehru",
                                        "page_id": "sIAU9UeZB",
                                        "children": []
                                    },
                                    {
                                        "id": "TxVig7uT-",
                                        "text": "2. Union Constitution Committee – Jawaharlal Nehru",
                                        "page_id": "sIAU9UeZB",
                                        "children": []
                                    },
                                    {
                                        "id": "9_o9_6Rtd",
                                        "text": "3. Provincial Constitution Committee – Sardar Patel",
                                        "page_id": "sIAU9UeZB",
                                        "children": []
                                    },
                                    {
                                        "id": "InfAcJkEe",
                                        "text": "4. Drafting Committee – Dr. B.R. Ambedkar",
                                        "page_id": "sIAU9UeZB",
                                        "children": []
                                    },
                                    {
                                        "id": "itWEMx_IP",
                                        "text": "5. Advisory Committee on Fundamental Rights, Minorities and Tribal and Excluded Areas – Sardar Patel",
                                        "page_id": "sIAU9UeZB",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "1VwVScbGq",
                                "heading": 3,
                                "text": "Drafting committee",
                                "page_id": "sIAU9UeZB",
                                "children": [
                                    {
                                        "id": "hwJ6cETwP",
                                        "text": "The Drafting Committee was the most important committee of the constituent assembly formed on August 29, 1947. It was tasked with preparing a draft of the new Constitution for independent India.\nIt has **7 members** and **Dr. B.R. Ambedkar was appointed as the Chairman** of the Drafting Committee. He is often referred to as the principal architect of the Indian Constitution.",
                                        "page_id": "sIAU9UeZB",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "fnwunoCkB",
                                "text": "The Constitution as adopted on November 26, 1949, contained a Preamble, 395 Articles and 8 Schedules. The Preamble was enacted after the entire Constitution was already enacted.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "8qGMVH7pk",
                        "heading": 3,
                        "text": "Important Dates: ",
                        "page_id": "sIAU9UeZB",
                        "video_id": "7BhltHb6sFQ",
                        "time": 293,
                        "children": [
                            {
                                "id": "kaiL_qT9-",
                                "text": "**December 6, 1946**: The Constituent Assembly convened for the first time. Dr. Sachchidananda Sinha, the oldest member of the Assembly, was appointed as the chairman for the first day.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "9OATzWSdk",
                                "text": "**December 9, 1946**: Elections were held for the positions of President and Vice-President of the Assembly. Dr. Rajendra Prasad was elected as President, and H.C. Mukherjee was elected as Vice-President.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "-IAh8or9I",
                                "text": "**December 11, 1946**: Jawaharlal Nehru moved the Objective Resolution. It was passed unanimously by the Assembly on January 22, 1947. On the last working day of the Constituent Assembly, January 24, 1949, this Objective Resolution, after some amendments, was adopted as the preamble of the Constitution.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "LUYqw07Ud",
                                "text": "**November 26, 1949**: The Constituent Assembly adopted the Constitution. This date is mentioned in the preamble, and thus due to this reason \"Nov 26\" is celebrated as the constitution day in India.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "ULMdUxl3W",
                                "text": "**January 24, 1950**: This was the last working day of the Constituent Assembly. On this day, the Preamble, National Anthem, and National Song were adopted.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "FgLjbaawT",
                                "text": "**January 25, 1950**: The Election Commission of India was appointed. This day is celebrated as National Voters' Day.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            },
                            {
                                "id": "PNjDcI3uQ",
                                "text": "**January 26, 1950**: The Constitution came into force. Dr. Rajendra Prasad took oath as the first President of India, replacing the Governor-General as the head of state. Since the President is indirectly elected, India became a republic on this day. Republic means a state where the head of state is elected. And now the head of the state is elected by Indians, and on this day India became a sovereign state. \nBefore Aug 15 1947: India was a British colony\nAfter Aug 15 1947: India was a British dominion\nOn Jan 26 1950: India became a sovereign, democratic, republic nation state.",
                                "page_id": "sIAU9UeZB",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "lNg2LR08t",
                "title": "[[Preamble]]",
                "text": "[[Preamble]]",
                "type": "page",
                "data": [
                    {
                        "id": "jeewQeTv4",
                        "heading": 3,
                        "text": "Introduction ",
                        "page_id": "lNg2LR08t",
                        "children": [
                            {
                                "id": "NClzsgLw0",
                                "text": "The American Constitution was the first to begin with a Preamble. Many countries, including India, followed this practice. The term ‘preamble’ refers to the introduction or preface to the Constitution. It contains the summary or essence of the Constitution. ",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "3NFhtHYgI",
                                "text": "N A Palkhivala, an eminent jurist and constitutional expert, called the Preamble as the ‘identity card of the Constitution.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "1fOTIeZqS",
                                "text": "The Preamble to the Indian Constitution is based on the **'Objectives Resolution'**, which was drafted and moved by Pandit Jawaharlal Nehru and adopted by the Constituent Assembly.\nOn **December 13, 1946**, Jawaharlal Nehru introduced the Objectives Resolution in the Constituent Assembly.\nIt was unanimously adopted by the Constituent Assembly on **January 22, 1947**.\nOn the last working day of the Constituent Assembly, **January 24, 1950**, the Objectives Resolution, with some amendments, was adopted as the Preamble to the Indian Constitution.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "SyqcHhzcH",
                        "heading": 3,
                        "text": "TEXT OF THE PREAMBLE ",
                        "page_id": "lNg2LR08t",
                        "children": [
                            {
                                "id": "MOtJmHQ0T",
                                "text": "“We, THE PEOPLE OF INDIA, having solemnly resolved to constitute India into a SOVEREIGN SOCIALIST SECULAR DEMOCRATIC REPUBLIC and to secure to all its citizens:\n\nJUSTICE, Social, Economic and Political; \nLIBERTY of thought, expression, belief, faith and worship; \nEQUALITY of status and of opportunity; and to promote among them all; FRATERNITY assuring the dignity of the individual and the unity and integrity of the Nation; \n\nIN OUR CONSTITUENT ASSEMBLY this twenty-sixth day of November, 1949, do HEREBY ADOPT, ENACT AND GIVE TO OURSELVES THIS CONSTITUTION”.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "t7r_ZiQFl",
                        "text": "Preamble: Borrowed from USA constitution\nIdea of \"JUSTICE\" was borrowed from USSR constitution\nIdea of \"Republic, LIBERTY, EQUALITY, FRATERNITY\" was borrowed from French constitution.",
                        "page_id": "lNg2LR08t",
                        "children": []
                    },
                    {
                        "id": "0fqtRINTq",
                        "heading": 3,
                        "text": "INGREDIENTS OF THE PREAMBLE",
                        "page_id": "lNg2LR08t",
                        "children": [
                            {
                                "id": "8MIxurTaV",
                                "text": "The Preamble reveals four ingredients or components:",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "NLHxcHHi9",
                                "text": "Source of authority of the Constitution: The Preamble states that the Constitution derives its authority from the people of India.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "L1tTV0CAO",
                                "text": "Nature of Indian State: It declares India to be of a sovereign, socialist, secular democratic and republican polity.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "G2ea6o6Uh",
                                "text": "Objectives of the Constitution: It specifies justice, liberty, equality and fraternity as the objectives.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "RwDd4l_Tu",
                                "text": "Date of adoption of the Constitution: is November 26, 1949. \nOn this date constitution was adopted.\nThis date is mentioned in the preamble, and is celebrated as \"national constitution day\" in India.\nThough the constitution was adopted on \"Nov 26 1949\" but it came into force two months later i.e on \"January 26th 1950\", and on this date India became a sovereign republic state.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "2wtgZheGC",
                        "heading": 3,
                        "text": "PREAMBLE AS PART OF THE CONSTITUTION",
                        "page_id": "lNg2LR08t",
                        "children": [
                            {
                                "id": "mDQ5XBehT",
                                "text": "As the constitution was adopted on Nov 26 1946, where as the preamble was adopted on Jan 24 1950, the last working day of the constitution, and thus one of the controversies about the Preamble is as to whether it is a part of the Constitution or not.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "SmEsr6r-a",
                                "text": "In the **Berubari case (1960)**, the Supreme Court said that the **Preamble is not a part of the constitution**, but it shows the general purposes behind the several provisions in the Constitution, and is thus a key to the minds of the makers of the Constitution. Thus the SC also held that \"preamble can be used a guide for interpretation of the constitution\".",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "fzv0x8DVh",
                                "text": "In the **Kesavananda Bharati case (1973)**, the Supreme Court rejected the earlier opinion and held that **Preamble is a part of the Constitution**.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "65V5xYw7h",
                        "heading": 3,
                        "text": "AMENDABILITY OF THE PREAMBLE",
                        "page_id": "lNg2LR08t",
                        "children": [
                            {
                                "id": "AIrD3Uksw",
                                "text": "The question of whether the Preamble could be amended first arose in the landmark case of Kesavananda Bharati (1973). Initially, it was argued that the Preamble, not being a part of the Constitution, could not be amended. However, in the Kesavananda Bharati case, the Supreme Court held that the Preamble is indeed a part of the Constitution and can be amended, provided such amendments do not alter its basic structure.\n",
                                "page_id": "lNg2LR08t",
                                "children": []
                            },
                            {
                                "id": "wPuEqDfZB",
                                "text": "Subsequently, in 1976, the Parliament amended the Preamble through the 42nd Amendment Act, 1976. This amendment introduced three new crucial terms into the Preamble: \"SOCIALIST,\" \"SECULAR,\" and \"Integrity,\" thereby reflecting the evolving socio-political aspirations of the nation.",
                                "page_id": "lNg2LR08t",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "UxdYxk7nD",
                "title": "[[Citizenship]]",
                "text": "[[Citizenship]]",
                "type": "page",
                "data": [
                    {
                        "id": "tkKx6rQHL",
                        "text": "The Part-II (article 5-11) of the Indian Constitution deal with the concept of citizenship.",
                        "page_id": "UxdYxk7nD",
                        "children": [
                            {
                                "id": "mGkOwKQf_",
                                "text": "",
                                "page_id": "UxdYxk7nD",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "OBJzBa_aY",
                        "text": "**Article 5**: Citizenship at the commencement of the Constitution\nAny person who was born in India or had either of their parents born in India, or who has been ordinarily resident in India for at least five years immediately preceding the commencement of the Constitution, is considered a citizen of India.",
                        "page_id": "UxdYxk7nD",
                        "children": []
                    },
                    {
                        "id": "Gb9KB5HX7",
                        "text": "**Article 6**: Rights of citizenship of certain persons who have migrated to India from Pakistan\nPersons who migrated to India from Pakistan before July 19, 1948, and have been resident in India since their migration, are considered citizens of India. For those who migrated after this date, they must have been registered as citizens.",
                        "page_id": "UxdYxk7nD",
                        "children": []
                    },
                    {
                        "id": "cWyy-Lk1B",
                        "text": "**Article 7**: Rights of citizenship of certain migrants to Pakistan\nIndividuals who migrated to Pakistan after March 1, 1947, and returned to India under a permit for resettlement can be citizens of India if they meet certain conditions.",
                        "page_id": "UxdYxk7nD",
                        "children": []
                    },
                    {
                        "id": "TIspiAOCh",
                        "text": "**Article 8**: Rights of citizenship of certain persons of Indian origin residing outside India\nPersons of Indian origin residing outside India who hold citizenship of a country outside India can become citizens of India if they are registered by the diplomatic or consular representatives of India in the country where they are residing.",
                        "page_id": "UxdYxk7nD",
                        "children": []
                    },
                    {
                        "id": "DrmOr3p-p",
                        "text": "**Article 9**: Persons voluntarily acquiring citizenship of a foreign State not to be citizens\nIf a person voluntarily acquires the citizenship of any foreign state, they will no longer be a citizen of India.\nIt says that India adopts \"single citizenship\". \nIndia borrowed this feature from Canada constitution. \nIndia and Canada have single citizenship and on the other hand USA has dual citizenship i.e citizenship of centre as well as state. \nIf an indian citizen accepts citizenship of any other country then he/she will lose his/her indian citizenship automatically. ",
                        "page_id": "UxdYxk7nD",
                        "children": []
                    },
                    {
                        "id": "MelAMk9hV",
                        "text": "**Article 10**: Continuance of the rights of citizenship",
                        "page_id": "UxdYxk7nD",
                        "children": [
                            {
                                "id": "NoWlgAd9s",
                                "text": "Every person who is or is deemed to be a citizen of India shall continue to be such a citizen, subject to the provisions of any law that Parliament may make.",
                                "page_id": "UxdYxk7nD",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "4l9boYrC-",
                        "text": "**Article 11**: Parliament to regulate the right of citizenship by law",
                        "page_id": "UxdYxk7nD",
                        "children": [
                            {
                                "id": "-niTkVofT",
                                "text": "In the 7th schedule of the constitution the \"citizenship\" is a subject uder union list. The Parliament has the authority to make any provision regarding the acquisition and termination of citizenship and all other matters related to citizenship. In this regard the parliament enacted Citizenship Act 1955. ",
                                "page_id": "UxdYxk7nD",
                                "children": []
                            },
                            {
                                "id": "PUN71BsnO",
                                "heading": 3,
                                "text": "The Citizenship Act, 1955",
                                "page_id": "UxdYxk7nD",
                                "children": [
                                    {
                                        "id": "ebleLa5Qm",
                                        "text": "The Citizenship Act, 1955 provides the law for acquisition and termination of Indian citizenship. Here’s a brief overview:",
                                        "page_id": "UxdYxk7nD",
                                        "children": []
                                    },
                                    {
                                        "id": "jVu6K-L13",
                                        "text": "**Acquisition of Citizenship**:",
                                        "page_id": "UxdYxk7nD",
                                        "children": [
                                            {
                                                "id": "5_0Z0QkRt",
                                                "text": "**By Birth**: A person born in India is a citizen if at least one parent is a citizen of India.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            },
                                            {
                                                "id": "Ov8dd1MWd",
                                                "text": "**By Descent**: A person born outside India is a citizen if either parent is a citizen of India at the time of birth.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            },
                                            {
                                                "id": "I4uO-Ar7m",
                                                "text": "**By Registration**: Certain categories of persons, including persons of Indian origin who have been resident in India for seven years, can apply for citizenship by registration.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            },
                                            {
                                                "id": "bbMXY9cy3",
                                                "text": "**By Naturalization**: A foreigner can acquire Indian citizenship by naturalization if they have resided in India for twelve years and meet other qualifications specified in the Act.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            },
                                            {
                                                "id": "db78eOcuu",
                                                "text": "**By Incorporation of Territory**: If any new territory becomes part of India, the government may specify who among the people of the territory shall be citizens of India.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            }
                                        ]
                                    },
                                    {
                                        "id": "cErxRtCgo",
                                        "text": "**Loss of Citizenship**:",
                                        "page_id": "UxdYxk7nD",
                                        "children": [
                                            {
                                                "id": "cylhxeRmr",
                                                "text": "**By Renunciation**: Any Indian citizen who is also a citizen or intends to become a citizen of another country can renounce their Indian citizenship.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            },
                                            {
                                                "id": "k6vviS0fX",
                                                "text": "**By Termination**: If a citizen voluntarily acquires the citizenship of another country, their Indian citizenship is automatically terminated.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            },
                                            {
                                                "id": "BCqc-TL4F",
                                                "text": "**By Deprivation**: The government can deprive a person of their citizenship if it was acquired by fraud, or if the person has shown disloyalty to the Constitution, or has unlawfully traded with the enemy during war, among other grounds.",
                                                "page_id": "UxdYxk7nD",
                                                "children": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "id": "SkgMEEPLc",
                "title": "[[Fundamental Rights]]",
                "text": "[[Fundamental Rights]]",
                "type": "page",
                "data": [
                    {
                        "id": "XxtUAQbT0",
                        "heading": 3,
                        "text": "Introduction",
                        "page_id": "SkgMEEPLc",
                        "children": [
                            {
                                "id": "LmI0fH1J3",
                                "text": "Fundamental Rights are enshrined in **Part III** of the Indian Constitution, from Articles 12 to 35. \nThey are called as fundamental rights because they are **guaranteed** rights. \nThey are **enforceable** by court ( supreme court under article 32, high court under article 226).\nThese rights are essential for the overall development of individuals and the preservation of human dignity. They form the cornerstone of India's democratic system and ensure that citizens can live a life of equality, freedom, and justice.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "B-wt-EKni",
                        "heading": 3,
                        "text": "Key Features of Fundamental Rights:",
                        "page_id": "SkgMEEPLc",
                        "children": [
                            {
                                "id": "uFBhhKaL9",
                                "text": "**Universal Application**: Fundamental Rights apply universally to all citizens, irrespective of race, religion, caste, gender, or place of birth.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "v9rEt1W4V",
                                "text": "**Justiciable**: These rights are enforceable by the courts, meaning individuals can approach the judiciary if they feel their rights are being violated.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "B2N_bHlrI",
                                "text": "**Non absolute** They are not absolute and the state can put reasonable restrictions.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "KvqsNgen5",
                                "text": "**Protection Against State Action**: Fundamental Rights primarily act as a check against the arbitrary actions of the state and its organs.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "KbwkArVB9",
                                "text": "**Negative and Positive Obligations**: Some rights place negative obligations on the state (to refrain from certain actions), while others impose positive obligations (to take specific actions).",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "GLKiz-tJG",
                        "heading": 3,
                        "text": "Classification of Fundamental Rights:",
                        "page_id": "SkgMEEPLc",
                        "children": [
                            {
                                "id": "WjrZIyUAn",
                                "text": "The Constitution of India originally provided for seven Fundamental Rights. However, in 1978, the Right to Property was removed from Part III (Article 31) and moved to Part XII (Article 300A). As a result, there are currently six Fundamental Rights in the Indian Constitution. These rights are essential for ensuring individual liberties and maintaining the democratic framework of the country.\n",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "OtjuDuJtl",
                                "text": "The Six Fundamental Rights are:\n1. Right to Equality\n2. Right to Freedom\n3. Right Against Exploitation\n4. Right to Freedom of Religion\n5. Cultural and Educational Rights\n6. Right to Constitutional Remedies\n\nThe \"Right to Property\" is no more a fundamental right. ",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "FE2Yi8gDN",
                                "text": "**Right to Equality (Articles 14-18)**:",
                                "page_id": "SkgMEEPLc",
                                "children": [
                                    {
                                        "id": "RejOiFkHS",
                                        "text": "**Article 14**: Equality before law and equal protection of laws.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "YDNrZ8jym",
                                        "text": "**Article 15**: Prohibition of discrimination on grounds of religion, race, caste, sex, or place of birth.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "f3pGsSGKJ",
                                        "text": "**Article 16**: Equality of opportunity in matters of public employment.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "0zeCelV4v",
                                        "text": "**Article 17**: Abolition of untouchability.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "duYYYBFtW",
                                        "text": "**Article 18**: Abolition of titles except in military and academic.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "0A_AznV6c",
                                "text": "**Right to Freedom (Articles 19-22)**:",
                                "page_id": "SkgMEEPLc",
                                "children": [
                                    {
                                        "id": "5KQEAVieO",
                                        "text": "**Article 19**: Protection of certain rights regarding freedom of speech, assembly, association, movement, residence, and profession.",
                                        "page_id": "SkgMEEPLc",
                                        "children": [
                                            {
                                                "id": "0wjLvSHq-",
                                                "text": "",
                                                "page_id": "SkgMEEPLc",
                                                "children": []
                                            }
                                        ]
                                    },
                                    {
                                        "id": "YI_VOLqnP",
                                        "text": "**Article 20**: Protection in respect of conviction for offenses.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "qzLblPcNA",
                                        "text": "**Article 21**: Protection of life and personal liberty.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "QJXbOYexc",
                                        "text": "**Article 21A**: Right to free education for children between 6 to 14 age. It was added via 86th amendment 2002. ",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "7SeIGyYsw",
                                        "text": "**Article 22**: Protection against arrest and detention in certain cases.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "UNFkbvBV2",
                                "text": "**Right Against Exploitation (Articles 23-24)**:",
                                "page_id": "SkgMEEPLc",
                                "children": [
                                    {
                                        "id": "CnA4FnpYN",
                                        "text": "**Article 23**: Prohibition of traffic in human beings and forced labor.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "rduz38-e7",
                                        "text": "**Article 24: Prohibition of employment of children:**\nThis article explicitly prohibits the employment of children below the age of 14 years in factories, mines, and other hazardous occupations. This provision is crucial for safeguarding the health, safety, and development of children, ensuring that they are not subjected to work environments that could be detrimental to their physical and mental well-being.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "oMvo36emd",
                                "text": "**Right to Freedom of Religion (Articles 25-28)**:",
                                "page_id": "SkgMEEPLc",
                                "children": [
                                    {
                                        "id": "YGp6qS4VS",
                                        "text": "**Article 25**: Freedom of conscience and free profession, practice, and propagation of religion.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "ZVUSYTC2m",
                                        "text": "**Article 26**: Freedom to manage religious affairs.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "Dgax1NGwN",
                                        "text": "**Article 27**: Freedom from payment of taxes for promotion of any religion.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "lggnKPLav",
                                        "text": "**Article 28**: Freedom from attending religious instruction or worship in certain educational institutions.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "s1Uno6T15",
                                "text": "**Cultural and Educational Rights (Articles 29-30)**:",
                                "page_id": "SkgMEEPLc",
                                "children": [
                                    {
                                        "id": "9eb-zYNAj",
                                        "text": "**Article 29**: Protection of interests of minorities.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    },
                                    {
                                        "id": "1SxXyLtKH",
                                        "text": "**Article 30**: Right of minorities to establish and administer educational institutions.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "cKdYH94Uq",
                                "text": "**Right to Constitutional Remedies (Article 32)**:",
                                "page_id": "SkgMEEPLc",
                                "children": [
                                    {
                                        "id": "2RlohEla8",
                                        "text": "**Article 32**: The right to move the Supreme Court for the enforcement of Fundamental Rights.",
                                        "page_id": "SkgMEEPLc",
                                        "children": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "id": "ME6T6DV3X",
                        "heading": 3,
                        "text": "Importance of Fundamental Rights:",
                        "page_id": "SkgMEEPLc",
                        "children": [
                            {
                                "id": "r3llAjlKI",
                                "text": "**Protection of Individual Liberties**: They safeguard individual freedoms and protect against state tyranny.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "nVADp77nF",
                                "text": "**Promotion of Social Justice**: They promote social equality and justice, essential for the progress of any democracy.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            },
                            {
                                "id": "uvuAehaoi",
                                "text": "**Foundation of Democracy**: They provide a framework for a democratic society where the rule of law prevails.",
                                "page_id": "SkgMEEPLc",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "_iv8-drzV",
                "title": "[[DPSP]]",
                "text": "[[DPSP]]",
                "type": "page",
                "data": [
                    {
                        "id": "7SmENc69P",
                        "heading": 3,
                        "text": "Introduction",
                        "page_id": "_iv8-drzV",
                        "children": [
                            {
                                "id": "9Q2ZFTVum",
                                "text": "The Directive Principles of State Policy (DPSP) are guidelines for the government to follow when making laws. \nThese principles are found in Part IV (Articles 36-51) of the Indian Constitution. \nThey are borrowed from Ireland constitution.\nEven though these principles can't be enforced by any court i.e non-enforceable, they are very important for governing the country. They aim to create conditions where everyone can live a good life. The DPSPs help the government to make laws and policies that aim to create a fair and just society. India borrowed the DPSP from Ireland constitution.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "OnQWf-9Rb",
                                "text": "The DPSP is **not enforceable by law;** where as fundamental rights are-justiciable. Unlike the Fundamental Rights (FRs), the **scope of DPSP is limitless** and it protects the rights of a citizen and work at a **macro level.** DPSP consists of all the **ideals which the State should follow** and keep in mind while formulating policies and enacting laws for the country.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "N7-7372mw",
                        "heading": 3,
                        "text": "Article of DPSP",
                        "page_id": "_iv8-drzV",
                        "children": [
                            {
                                "id": "TEamDET3P",
                                "text": "**Article 36:**\nThis article explains what the term \"State\" means in the context of DPSP. The term \"State\" includes the government and Parliament of India, the government and the legislature of each state, and all local or other authorities within the territory of India or under the control of the Government of India.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "ZPLltXfEl",
                                "text": "**Article 37:** \nIt says that the DPSPs are **not enforceable** by any court, but they are fundamental in the governance of the country. The government must keep these principles in mind while making laws. These principles aim at ensuring **socioe-conomic justice** to the people and establishing India as a Welfare State.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "2XdhdUq5d",
                                "text": "**Article 38: State to Secure a Social Order for the Promotion of Welfare of the People**\nThe State shall strive to promote the welfare of the people by securing and protecting a social order by** ensuring social, economic and political justice** and by [**minimising inequalities** in income, status, facilities and opportunities] ( [..] added via 44th amendment 1978)\n(Socialist)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "ichJa1zhd",
                                "text": "**Articles 39:** The State shall in particular, direct its policies towards securing:\n> Right to an** adequate means of livelihood** to all the citizens.\n> The** ownership and control of material resources** shall be organised in a manner to serve the common good.\n> The State shall **avoid concentration of wealth in a few hands.**\n> **Equal pay for equal work** for both men and women.\n> The protection of the strength and health of the workers.\n> Childhood and youth shall not be exploited.\n(Socialist)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "pvUD562RD",
                                "text": "**Article 39A: Equal Justice and Free Legal Aid**\nIt was added via 42nd amendment act 1976\nThe government must ensure that the legal system promotes justice on the basis of equal opportunity. (Socialist)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "5ReOmFBH7",
                                "text": "**Article 40:** The government should take steps to **organize village panchayats** and give them powers and authority to function as units of self-government. (Ghandian)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "-9dU2Ri5p",
                                "text": "**Article 41:** To secure the** right to work, to education and to public assistance** in cases of unemployment, **old age, sickness and disability.** (Socialist)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "ImY8uKh4x",
                                "text": "**Article 42:** The State shall make provisions for **securing just and humane conditions of work and for maternity relief.** (Socialist)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "w8ur1m4Tu",
                                "text": "**Article 43: Living Wage, etc., for Workers**\nThe government should work to ensure that all workers get a decent wage, a good standard of living, and social and cultural opportunities. (Socalist)\nIt should also **promote cottage industries** in rural areas. (Ghandian)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "MbOb5L5XP",
                                "text": "**Article 43A: Participation of Workers in Management of Industries**\nThe government should take steps to ensure that workers have a say in the management of the industries where they work. This aims to improve worker-management relations and productivity.\nIt was added via 42nd amendment 1976",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "p2lWl5xx8",
                                "text": "**Article 43B:** The government should work to promote the formation and functioning of **cooperative societies**. \nArticle 43B encourages the government to support and promote cooperative societies. \nIt was added via 97th amendment 2011",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "oTdhFE6Ke",
                                "text": "**Article 44:** The government should work towards creating a **Uniform Civil Code** for all citizens across the country, ensuring that all people are governed by the same set of civil laws, irrespective of their religion.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "oLrQFbKT0",
                                "text": "**Article 45:** To provide early childhood care and education for all children until they complete the **age of six years..\nEarlier it was just \"care\", then in 2002 via 86th amendment act 2002 \"education\" was added",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "LLPNscbbb",
                                "text": "**Article 46: Promotion of Educational and Economic Interests of Scheduled Castes, Scheduled Tribes, and Other Weaker Sections** \nThe government should promote the **educational and economic interests** of the **weaker sections** of society, particularly the Scheduled Castes and Scheduled Tribes, and **protect them from social injustice and all forms of exploitation**.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "JeTRryHVB",
                                "text": "**Article 47: Duty of the State to Raise the Level of Nutrition and the Standard of Living and to Improve Public Health**\nThe government should work to raise the level of nutrition and the standard of living of the people and improve public health. This includes efforts to prohibit the consumption of intoxicating drinks and drugs that are harmful to health.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "bzDVkW44s",
                                "text": "**Article 48: Organisation of Agriculture and Animal Husbandry**\nThe government should take steps to **organize agriculture and animal husbandry on modern and scientific lines**. (Liberal)\nIt should also preserve and improve the breeds of animals and **prohibit the slaughter of cows** and calves and other milch and draught cattle. (Gandhian)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "a6HG-kGW9",
                                "text": "**Article 48A: Protection and Improvement of Environment and Safeguarding of Forests and Wildlife**\nThe government should make efforts to protect and improve the environment and to safeguard the forests and wildlife of the country. (Liberal)\nIt was added via 42nd amendment act 1976",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "4Fb7FfP2A",
                                "text": "**Article 49: Protection of Monuments and Places and Objects of National Importance**\nThe government should protect historic monuments, places, and objects of artistic or historic interest from damage, disfigurement, destruction, or removal.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "iHcm_-v4y",
                                "text": "**Article 50: Separation of Judiciary from Executive**\nThe government should take steps to separate the judiciary from the executive in the public services of the state. This aims to ensure the independence of the judiciary. And this DPSP is a part of the basic structure. (Liberal)",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "mfRpS3Bcn",
                                "text": "**Article 51: Promotion of International Peace and Security**\nThe government should work to:\n(a) Promote international peace and security.\n(b) Maintain just and honorable relations between nations.\n(c) Foster respect for international law and treaty obligations.\n(d) Encourage settlement of international disputes by arbitration.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "x7Yfww0L_",
                        "heading": 3,
                        "text": "Amendment of DPSP",
                        "page_id": "_iv8-drzV",
                        "children": [
                            {
                                "id": "d-VPSbqB_",
                                "text": "SO far DPSP was amended four times:\n1976: 42nd amendment, added 39(f), 39A, 42A, 48A\n1978: 44th amendment, added 38(2)\n2002: 85th amendment, amended 45\n2011: 97th amendment, added 43B",
                                "page_id": "_iv8-drzV",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "I1qWyUbKL",
                        "heading": 3,
                        "text": "Classification of DPSPs",
                        "page_id": "_iv8-drzV",
                        "children": [
                            {
                                "id": "DzZSMeerG",
                                "text": "The Directive Principles of State Policy (DPSP) are categorized based on their content into three main groups:",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "q_3pV5Z0h",
                                "text": "**Socialist Principles (Articles 38, 39, 39A, 41, 42, 43)**:\nThese principles aim to establish social and economic justice in society. They include provisions for ensuring fair wages, adequate livelihood, equal pay for equal work, protection of children and youth, and improvement in public health.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "CJEPsWl7I",
                                "text": "**Gandhian Principles (Articles 40, 43, 46, 47, 48)**:\nThese principles are inspired by Mahatma Gandhi's philosophy and focus on rural development, prohibition of alcohol consumption, promotion of cottage industries, and the welfare of weaker sections of society, including Scheduled Castes and Scheduled Tribes.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "XXrmNQhUR",
                                "text": "**Liberal Principles (Articles 44, 45, 48, 48A, 49, 50, 51)**:\nThese principles emphasize individual liberties, secularism, free and compulsory education for children, protection of monuments of national importance, separation of judiciary from the executive, promotion of international peace and security, and respect for international law and treaty obligations.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "1Y_OTP2Sb",
                        "heading": 3,
                        "text": "Conflicts Between FRs and DPSP",
                        "page_id": "_iv8-drzV",
                        "children": [
                            {
                                "id": "HNO9xzzrI",
                                "text": "**Champakam Dorairajan case (1951)**:\nIn this case, the Supreme Court ruled that if there is any conflict between Fundamental Rights and Directive Principles, Fundamental Rights take precedence.\nIt stated that Directive Principles must align with and be **subservient** to Fundamental Rights.\nThe Court also ruled that Parliament can amend Fundamental Rights through constitutional amendments.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "mvJ8jYW9k",
                                "text": "**Golaknath case (1967)**:\nThe Supreme Court declared that Fundamental Rights cannot be amended by Parliament, even to implement Directive Principles.\nThis decision contradicted its earlier ruling in the 'Shankari Prasad case' (where SC said FRs can be amended by parliament).",
                                "page_id": "_iv8-drzV",
                                "children": []
                            },
                            {
                                "id": "dEo_Ltq95",
                                "text": "**Kesavananda Bharati case (1973)**:",
                                "page_id": "_iv8-drzV",
                                "children": [
                                    {
                                        "id": "8eP399MGp",
                                        "text": "Overruling Golaknath, the Supreme Court held that Parliament has the power to amend any part of the Constitution. However, it established that Parliament cannot alter the \"Basic Structure\" of the Constitution. This case led to the removal of Right to Property (Article 31) from the list of Fundamental Rights.",
                                        "page_id": "_iv8-drzV",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "Ea5OeKO3C",
                                "text": "**Minerva Mills case (1980)**:",
                                "page_id": "_iv8-drzV",
                                "children": [
                                    {
                                        "id": "EHhgzNYme",
                                        "text": "The Supreme Court reaffirmed that Parliament can amend any part of the Constitution. It reiterated that the \"Basic Structure\" of the Constitution cannot be changed by Parliament.",
                                        "page_id": "_iv8-drzV",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "0VVLofP4b",
                                "text": "These cases highlight the evolving interpretations by the Supreme Court regarding the balance between Fundamental Rights and Directive Principles in India's constitutional framework.",
                                "page_id": "_iv8-drzV",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "Tz-a5ZI0c",
                "title": "[[Fundamental Duties]]",
                "text": "[[Fundamental Duties]]",
                "type": "page",
                "data": [
                    {
                        "id": "T3ZOsiycW",
                        "heading": 3,
                        "text": "Introduction of Fundamental Duties",
                        "page_id": "Tz-a5ZI0c",
                        "children": [
                            {
                                "id": "rSXEzWpFQ",
                                "text": "The concept of Fundamental Duties was not originally present in the Indian Constitution but introduced later to emphasize civic responsibilities and uphold national integrity. These duties were recommended by the **Swaran Singh Committee** in 1976 and added via the **42nd Amendment Act of 1976**, which introduced a **new Part IVA and Article 51A** to the Constitution.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "vzKO41XwU",
                                "text": "Initially, there were 10 Fundamental Duties enumerated under Article 51A (via 42nd amendment 1976). These duties were inspired by similar provisions in the constitutions of socialist countries like the USSR, reflecting a collective responsibility towards society and the nation. The 86th Amendment Act, 2002 added an 11th Fundamental Duty to Article 51A, which emphasizes the importance of parents or guardians ensuring that their children receive education between the ages of six and fourteen years.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "Qoieab01N",
                        "heading": 3,
                        "text": "Key Points:",
                        "page_id": "Tz-a5ZI0c",
                        "children": [
                            {
                                "id": "gWF358z8s",
                                "text": "**Origins:** Borrowed from the USSR constitution. They are not enforceable, but they highlight the role of citizens in fostering a harmonious and inclusive society.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "8_bgk1WrL",
                                "text": "**42nd Amendment (1976):** Significantly amended the Constitution to include Part IVA and Article 51A, outlining the initial 10 Fundamental Duties.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "dKPcQDXjl",
                                "text": "**86th Amendment (2002):** Introduced the 11th Fundamental Duty, underlining the obligation of parents towards educating their children.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "oWBbBU2cO",
                        "heading": 3,
                        "text": "Purpose and Significance:",
                        "page_id": "Tz-a5ZI0c",
                        "children": [
                            {
                                "id": "bBdruTWII",
                                "text": "The inclusion of Fundamental Duties aims to:",
                                "page_id": "Tz-a5ZI0c",
                                "children": [
                                    {
                                        "id": "Ltr3tMa1a",
                                        "text": "Foster a sense of responsibility and discipline among citizens.",
                                        "page_id": "Tz-a5ZI0c",
                                        "children": []
                                    },
                                    {
                                        "id": "hZRu8FR5F",
                                        "text": "Strengthen the social fabric and promote a sense of patriotism and nationalism.",
                                        "page_id": "Tz-a5ZI0c",
                                        "children": []
                                    },
                                    {
                                        "id": "SFcc6WJNX",
                                        "text": "Balance rights with duties, recognizing that the enjoyment of rights must be accompanied by responsibilities towards society and the nation.",
                                        "page_id": "Tz-a5ZI0c",
                                        "children": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "id": "AOu6-9NnM",
                        "heading": 3,
                        "text": "11 Fundamental Duties",
                        "page_id": "Tz-a5ZI0c",
                        "children": [
                            {
                                "id": "nfkAgQsBS",
                                "text": "1. To abide by the Constitution and respect its ideals and institutions, the National Flag, and the National Anthem.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "2coslR_Rz",
                                "text": "2. To cherish and follow the noble ideals that inspired the national struggle for freedom.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "E3lDQthq9",
                                "text": "3. To uphold and protect the sovereignty, unity, and integrity of India.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "F4HWTknlX",
                                "text": "4. To defend the country and render national service when called upon to do so.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "28W0pX89j",
                                "text": "5. To promote harmony and the spirit of common brotherhood among all the people of India transcending religious, linguistic, and regional or sectional diversities.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "p5_vzvdhR",
                                "text": "6. To value and preserve the rich heritage of the country’s composite culture.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "Px5XNXRno",
                                "text": "7. To protect and improve the natural environment, including forests, lakes, rivers, and wildlife, and to have compassion for living creatures.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "-TKORIqhc",
                                "text": "8. To develop scientific temper, humanism, and the spirit of inquiry and reform.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "Wo2RRVl-e",
                                "text": "9. To safeguard public property and to abjure violence.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "DgW8D2AqS",
                                "text": "10. To strive towards excellence in all spheres of individual and collective activity, so that the nation constantly rises to higher levels of endeavor and achievement.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            },
                            {
                                "id": "yPDQgVVGp",
                                "text": "11. To provide opportunities for education to children between 6-14 years of age and duty as parents to ensure that such opportunities are being awarded to their child.\nThis fundamental right was not there in 1976, but it was added later via 86th amendment 2002.",
                                "page_id": "Tz-a5ZI0c",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "mvYjfsdTW",
                "title": "[[Revolt of 1857]]",
                "text": "[[Revolt of 1857]]",
                "type": "page",
                "data": [
                    {
                        "id": "Y9pasbs-9",
                        "heading": 3,
                        "text": "The 1857 revolt was initiated due to various factors which are stated below:\n",
                        "page_id": "mvYjfsdTW",
                        "children": [
                            {
                                "id": "yQjLomeEW",
                                "text": "Religious & Social Causes – Racism or racial discrimination was believed to be a major reason for the revolt of 1857 wherein Indians were exploited and were kept away from mixing with Europeans. The whites also started interfering in the religious and cultural affairs of Indians and tortured them as well.\nTo know more about the Social causes for revolt of 1857, refer to the linked article.",
                                "page_id": "mvYjfsdTW",
                                "children": []
                            },
                            {
                                "id": "qO3iPw-4c",
                                "text": "Political Causes – The British expansion had led to the propagation of unjust policies that led to the loss of power of the Nawabs and Zamindars residing at various places of India. The introduction of unfair policies like the policy of Trade and Commerce, the policy of indirect subordination (subsidiary alliance), the policy of war and annexation, the policy of direct subordination (doctrine of lapse), the policy of misgovernance (through which Awadh was annexed) greatly hampered the interests of the rulers of the native states, and they one by one became victims of British expansionism. Therefore, those rulers, who lost their states to the British, were naturally against the British and took sides against them during the revolt.\nEconomic Factors – There were various reforms in the taxation and revenue system that affected the peasants heavily. British Government had imposed and introduced various administrative policies to expand their territory.\n",
                                "page_id": "mvYjfsdTW",
                                "children": []
                            },
                            {
                                "id": "35DeTIJh-",
                                "text": "Military Factors: Another major cause was the General Enlistment Act of July 25 1856. Passed 10 months before the rebellion, the act required that new recruits to the Bengal Army to accept a commitment for general service. Earlier the enlisted men of the Bengal Army had been exempted from serving overseas as they believed that such an act would be against their beliefs. But the Madras and Bombay regiments had no such inhibitions. Governor-General Lord Dalhousie felt it unfair that the burden of deployment fell squarely on the smaller presidency armies. With the signing of the act, sepoys of the Bengal Army felt that it would also prevent their sons from following their footsteps while fearing the prospect of serving overseas.",
                                "page_id": "mvYjfsdTW",
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ],
        "type": "heading"
    }
]