[
    {
        "id": "_ccDlx068",
        "text": "POLITY",
        "children": [
            {
                "id": "TDStF06cP",
                "title": "[[Constituent Assembly]]",
                "text": "[[Constituent Assembly]]",
                "type": "page",
                "data": [
                    {
                        "id": "k_fwETu-K",
                        "text": "**British Colonial Rule**: India was under British colonial rule, and the struggle for independence had gained momentum by the early 20th century.",
                        "page_id": "TDStF06cP",
                        "children": []
                    },
                    {
                        "id": "c4axyJurh",
                        "text": "**Demand for Self-Governance**: The demand for self-governance and a constitution reflecting the aspirations of the Indian people became more pronounced.",
                        "page_id": "TDStF06cP",
                        "children": []
                    },
                    {
                        "id": "Y9kFOU8-L",
                        "heading": 3,
                        "text": "History of Formation",
                        "page_id": "TDStF06cP",
                        "video_id": "7BhltHb6sFQ",
                        "time": 120,
                        "children": [
                            {
                                "id": "Gyc1PQZ-k",
                                "text": "In 1922, Mahatma Gandhi, in an article titled ‘Independence’ published in Young India, wrote that Swaraj would not be a free gift of the British Parliament but a declaration of India’s full self-expression—the Constitution of India would be framed as per the wishes of the Indians.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "Gd8nN87pr",
                                "text": "The Commonwealth of India Bill, which was drafted in India and to which Annie Besant, Tej Bahadur Sapru, V.S. Srinivasa Shastri made important contributions, was accepted unanimously by the executive committee of the Parliamentary Labour Party. The Bill had its first reading in the House of Commons in December 1925; it was defeated",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "14ETfmtKK",
                                "text": "Motilal Nehru in February 1924 introduced in the Central Legislative Assembly a resolution that gave due regard to minority rights and interests and came to be known as the **National Demand**.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "zp1EhhPko",
                                "text": "Britain, in response to the National Demand, appointed the all-white **Simon Commission** in November 1927 to recommend further constitutional changes.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "CyRp0eWIm",
                                "text": "In response to Lord Birkenhead’s challenge, the indians appointed the Nehru committee which submitted its report in August 1928, which was later rejected by the British government.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "3_6gW_eVx",
                                "text": "M.N. Roy in 1934 for the first time suggested for making a constitution assembly to draft a constitution for India. The Indian national congress held its session at Lucknow in April 1936 presided by Jawaharlal Nehru. The official demand for a Constituent Assembly was raised and the Government of India Act, 1935 was rejected as it was an imposition on the people of India.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "dW24GYQr9",
                                "text": "**Cabinet Mission Plan (1946)**: The British government sent the Cabinet Mission to India in 1946 to discuss the transfer of power. The mission proposed a plan to form a Constituent Assembly to draft a new constitution. Thus the constituent assembly was formed in 1946 as per the recommendation of the cabinet mission plan.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "yfrSccXHd",
                                "text": "**Elections for Constituent Assembly** The Assembly consisted of representatives (389) from various provinces (296) and princely states (92). The elected members of the Constituent Assembly were chosen indirectly by the Provincial Legislative Assemblies following the Cabinet Mission Plan. Members from the princely states were nominated by the princes. Thus, the Constituent Assembly consisted of both elected and appointed members.",
                                "page_id": "TDStF06cP",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "c1TlX7BuV",
                        "heading": 3,
                        "text": "Important Committees",
                        "page_id": "TDStF06cP",
                        "video_id": "7BhltHb6sFQ",
                        "time": 223,
                        "children": [
                            {
                                "id": "qfcy8PxFv",
                                "heading": 3,
                                "text": "Major Committees",
                                "page_id": "TDStF06cP",
                                "children": [
                                    {
                                        "id": "bNKBBVrs-",
                                        "text": "1. Union Powers Committee – Jawaharlal Nehru",
                                        "page_id": "TDStF06cP",
                                        "children": []
                                    },
                                    {
                                        "id": "TxVig7uT-",
                                        "text": "2. Union Constitution Committee – Jawaharlal Nehru",
                                        "page_id": "TDStF06cP",
                                        "children": []
                                    },
                                    {
                                        "id": "9_o9_6Rtd",
                                        "text": "3. Provincial Constitution Committee – Sardar Patel",
                                        "page_id": "TDStF06cP",
                                        "children": []
                                    },
                                    {
                                        "id": "InfAcJkEe",
                                        "text": "4. Drafting Committee – Dr. B.R. Ambedkar",
                                        "page_id": "TDStF06cP",
                                        "children": []
                                    },
                                    {
                                        "id": "itWEMx_IP",
                                        "text": "5. Advisory Committee on Fundamental Rights, Minorities and Tribal and Excluded Areas – Sardar Patel",
                                        "page_id": "TDStF06cP",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "1VwVScbGq",
                                "heading": 3,
                                "text": "Drafting committee",
                                "page_id": "TDStF06cP",
                                "children": [
                                    {
                                        "id": "hwJ6cETwP",
                                        "text": "The Drafting Committee was the most important committee of the constituent assembly formed on August 29, 1947. It was tasked with preparing a draft of the new Constitution for independent India.\nIt has **7 members** and **Dr. B.R. Ambedkar was appointed as the Chairman** of the Drafting Committee. He is often referred to as the principal architect of the Indian Constitution.",
                                        "page_id": "TDStF06cP",
                                        "children": []
                                    }
                                ]
                            },
                            {
                                "id": "fnwunoCkB",
                                "text": "The Constitution as adopted on November 26, 1949, contained a Preamble, 395 Articles and 8 Schedules. The Preamble was enacted after the entire Constitution was already enacted.",
                                "page_id": "TDStF06cP",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "8qGMVH7pk",
                        "heading": 3,
                        "text": "Important Dates:",
                        "page_id": "TDStF06cP",
                        "video_id": "7BhltHb6sFQ",
                        "time": 293,
                        "children": [
                            {
                                "id": "kaiL_qT9-",
                                "text": "**December 6, 1946**: The Constituent Assembly convened for the first time. Dr. Sachchidananda Sinha, the oldest member of the Assembly, was appointed as the chairman for the first day.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "9OATzWSdk",
                                "text": "**December 9, 1946**: Elections were held for the positions of President and Vice-President of the Assembly. Dr. Rajendra Prasad was elected as President, and H.C. Mukherjee was elected as Vice-President.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "-IAh8or9I",
                                "text": "**December 11, 1946**: Jawaharlal Nehru moved the Objective Resolution. It was passed unanimously by the Assembly on January 22, 1947. On the last working day of the Constituent Assembly, January 24, 1949, this Objective Resolution, after some amendments, was adopted as the preamble of the Constitution.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "LUYqw07Ud",
                                "text": "**November 26, 1949**: The Constituent Assembly adopted the Constitution. This date is mentioned in the preamble, and thus due to this reason \"Nov 26\" is celebrated as the constitution day in India.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "ULMdUxl3W",
                                "text": "**January 24, 1950**: This was the last working day of the Constituent Assembly. On this day, the Preamble, National Anthem, and National Song were adopted.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "FgLjbaawT",
                                "text": "**January 25, 1950**: The Election Commission of India was appointed. This day is celebrated as National Voters' Day.",
                                "page_id": "TDStF06cP",
                                "children": []
                            },
                            {
                                "id": "PNjDcI3uQ",
                                "text": "**January 26, 1950**: The Constitution came into force. Dr. Rajendra Prasad took oath as the first President of India, replacing the Governor-General as the head of state. Since the President is indirectly elected, India became a republic on this day. Republic means a state where the head of state is elected. And now the head of the state is elected by Indians, and on this day India became a sovereign state. \nBefore Aug 15 1947: India was a British colony\nAfter Aug 15 1947: India was a British dominion\nOn Jan 26 1950: India became a sovereign, democratic, republic nation state.",
                                "page_id": "TDStF06cP",
                                "children": []
                            }
                        ]
                    }
                ]
            },
            {
                "id": "naQtPvGQj",
                "title": "[[Preamble]]",
                "text": "[[Preamble]]",
                "type": "page",
                "data": [
                    {
                        "id": "jeewQeTv4",
                        "heading": 3,
                        "text": "Introduction ",
                        "page_id": "naQtPvGQj",
                        "children": [
                            {
                                "id": "NClzsgLw0",
                                "text": "The American Constitution was the first to begin with a Preamble. Many countries, including India, followed this practice. The term ‘preamble’ refers to the introduction or preface to the Constitution. It contains the summary or essence of the Constitution. ",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "3NFhtHYgI",
                                "text": "N A Palkhivala, an eminent jurist and constitutional expert, called the Preamble as the ‘identity card of the Constitution.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "1fOTIeZqS",
                                "text": "The Preamble to the Indian Constitution is based on the ‘Objectives Resolution’, drafted and moved by Pandit Nehru, and adopted by the Constituent Assembly. It has been amended by the 42nd Constitutional Amendment Act (1976), which added three new words—socialist, secular and integrity.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "SyqcHhzcH",
                        "heading": 3,
                        "text": "TEXT OF THE PREAMBLE ",
                        "page_id": "naQtPvGQj",
                        "children": [
                            {
                                "id": "MOtJmHQ0T",
                                "text": "“We, THE PEOPLE OF INDIA, having solemnly resolved to constitute India into a SOVEREIGN SOCIALIST SECULAR DEMOCRATIC REPUBLIC and to secure to all its citizens:\n\nJUSTICE, Social, Economic and Political; \nLIBERTY of thought, expression, belief, faith and worship; \nEQUALITY of status and of opportunity; and to promote among them all; FRATERNITY assuring the dignity of the individual and the unity and integrity of the Nation; \n\nIN OUR CONSTITUENT ASSEMBLY this twenty-sixth day of November, 1949, do HEREBY ADOPT, ENACT AND GIVE TO OURSELVES THIS CONSTITUTION”.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "0fqtRINTq",
                        "heading": 3,
                        "text": "INGREDIENTS OF THE PREAMBLE",
                        "page_id": "naQtPvGQj",
                        "children": [
                            {
                                "id": "8MIxurTaV",
                                "text": "The Preamble reveals four ingredients or components:",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "NLHxcHHi9",
                                "text": "Source of authority of the Constitution: The Preamble states that the Constitution derives its authority from the people of India.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "L1tTV0CAO",
                                "text": "Nature of Indian State: It declares India to be of a sovereign, socialist, secular democratic and republican polity.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "G2ea6o6Uh",
                                "text": "Objectives of the Constitution: It specifies justice, liberty, equality and fraternity as the objectives.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "RwDd4l_Tu",
                                "text": "Date of adoption of the Constitution: is November 26, 1949 ",
                                "page_id": "naQtPvGQj",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "2wtgZheGC",
                        "heading": 3,
                        "text": "PREAMBLE AS PART OF THE CONSTITUTION",
                        "page_id": "naQtPvGQj",
                        "children": [
                            {
                                "id": "mDQ5XBehT",
                                "text": "As the constitution was adopted on Nov 26 1946, where as the preamble was adopted on Jan 24 1950, the last working day of the constitution, and thus one of the controversies about the Preamble is as to whether it is a part of the Constitution or not.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "SmEsr6r-a",
                                "text": "In the **Berubari case (1960)**, the Supreme Court said that the **Preamble is not a part of the constitution**, but it shows the general purposes behind the several provisions in the Constitution, and is thus a key to the minds of the makers of the Constitution.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            },
                            {
                                "id": "fzv0x8DVh",
                                "text": "In the **Kesavananda Bharati case (1973)**, the Supreme Court rejected the earlier opinion and held that **Preamble is a part of the Constitution**.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            }
                        ]
                    },
                    {
                        "id": "65V5xYw7h",
                        "heading": 3,
                        "text": "AMENDABILITY OF THE PREAMBLE",
                        "page_id": "naQtPvGQj",
                        "children": [
                            {
                                "id": "wPuEqDfZB",
                                "text": "The question of whether the Preamble could be amended first arose in the landmark case of Kesavananda Bharati (1973). Initially, it was argued that the Preamble, not being a part of the Constitution, could not be amended. However, in the Kesavananda Bharati case, the Supreme Court held that the Preamble is indeed a part of the Constitution and can be amended, provided such amendments do not alter its basic structure.\n\nSubsequently, in 1976, the Parliament amended the Preamble through the 42nd Amendment Act, 1976. This amendment introduced three new crucial terms into the Preamble: \"SOCIALIST,\" \"SECULAR,\" and \"Integrity,\" thereby reflecting the evolving socio-political aspirations of the nation.",
                                "page_id": "naQtPvGQj",
                                "children": []
                            }
                        ]
                    }
                ]
            }
        ],
        "type": "heading"
    },
    {
        "id": "KaBqXMCwP",
        "title": "",
        "text": "",
        "type": "page",
        "data": []
    }
]